README.org
#+TITLE: My literate Emacs Configuration
#+AUTHOR: Marcus

* Emacs Configuration 
:PROPERTIES:
:ID:       emacs-configuration
:END:

=WARNING=

This is my personal Emacs configuration. It is a work in progress. The relavant
configuration files are tangled from this Org-document (=C-c C-v t=). I don't
tangle on save or anything like that. This is a work in progress and will never
be done. This is a rabbit hole...

I regulary commit my configuration to github even though it is not working. Yes,
I know, I shouldn't but I do so you have been warned.

*Here be dragons*

If you are looking for insperation, check out these instead:
- [[https://sachachua.com/blog/][Sacha Chua's Living an awesome life]]
- [[https://protesilaos.com/][Protesilaos Stavrou's personal website]]
- [[https://www.spacemacs.org/][Spacemacs - a community-driven Emacs distribution]]
- [[https://github.com/doomemacs/doomemacs][Doom Emacs - a configuration framework for Emacs]]

If you want to learn more about Org:
- [[https://orgmode.org/manual/index.html][The Org manual]]
- [[https://www.gnu.org/software/emacs/tour/][A guided tour of Emacs]]
- [[https://www.gnu.org/software/emacs/manual/index.html][GNU Emacs Manuals Online]]
  
* Table of Contents
:PROPERTIES:
:TOC:      :include all :depth 4 :ignore (this) 
:ID:       484856C8-B2D9-4C7A-83C1-0D48CDE89C73
:END:
:CONTENTS:
- [[#emacs-configuration][Emacs Configuration]]
- [[#generate-files-and-file-headers][Generate files and file headers]]
  - [[#initel][init.el]]
  - [[#early-initel][early-init.el]]
  - [[#customel][custom.el]]
  - [[#aliases][Aliases]]
  - [[#profile][Profile]]
- [[#package-manager][Package Manager]]
- [[#macos-specifics][MacOS Specifics]]
  - [[#exec-path-from-shell][Exec path from shell]]
  - [[#macos-keyboard-settings][MacOS keyboard settings]]
- [[#look-and-feel][Look and Feel]]
  - [[#misc-settings][Misc settings]]
  - [[#minibuffer][Minibuffer]]
    - [[#which-key][Which key]]
    - [[#vertico][Vertico]]
    - [[#save-history][Save history]]
    - [[#marginalia][Marginalia]]
    - [[#orderless][Orderless]]
    - [[#emacs-minibuffer-configurations][Emacs minibuffer configurations]]
  - [[#themes-and-fonts][Themes and Fonts]]
    - [[#ef-themes][EF-themes]]
    - [[#doom-themes][Doom Themes]]
    - [[#modeline][Modeline]]
    - [[#fonts][Fonts]]
    - [[#icons][Icons]]
    - [[#windows][Windows]]
- [[#keybindings][Keybindings]]
  - [[#evil][Evil]]
  - [[#my-personal-key-bindings][My personal key bindings]]
  - [[#ivy-and-counsel][IVY and Counsel]]
  - [[#general-key-binding][General key binding]]
  - [[#helpful][Helpful]]
  - [[#move-text][Move text]]
- [[#programming][Programming]]
  - [[#version-control][Version control]]
    - [[#magit][Magit]]
  - [[#project-management][Project management]]
    - [[#projectile][Projectile]]
- [[#org][Org]]
  - [[#org][Org]]
  - [[#org-make-toc][Org make-toc]]
  - [[#org-tempo][Org tempo]]
  - [[#org-bullets][Org bullets]]
- [[#internet][Internet]]
  - [[#browse-url][Browse URL]]
  - [[#elfeed][Elfeed]]
- [[#shells-and-terminals][Shells and terminals]]
  - [[#eshell][Eshell]]
:END:

* Generate files and file headers
:PROPERTIES:
:ID:       08E0B3BE-774B-4765-B9E1-21CA3036235A
:END:
The file headers sets [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical-binding]] to true. I also try to warn people not to
use this configuration as is.

*Here be dragons*

** init.el
:PROPERTIES:
:ID:       A129EFF8-AF97-4AA4-9A69-95E27395853F
:END:
Header text and [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical binding]].

#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-

;;; Commentary:
;; This is my personal Emacs configuration. The file is tangled from a
;; literate org document where I try to document what each piece is for.
;; If you found my configurations you are free to use as you please, but
;; please read the whole thing before you do. I regulary commit my
;; configuration even though it is not working. Yes, I know, you shouldn't
;; do that but you have been warned.

;; Here be dragons

;; Code:
#+end_src

** early-init.el
:PROPERTIES:
:ID:       8755048C-55B8-48F9-BCBE-64AC05C2B069
:END:
Header text and [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical binding]].

#+begin_src emacs-lisp :tangle early-init.el
;;; early-init.el -*- lexical-binding: t; -*-

;;; Commentary:
;; This is my personal Emacs configuration. The file is tangled from a
;; literate org document where I try to document what each piece is for.
;; If you found my configurations you are free to use as you please, but
;; please read the whole thing before you do. I regulary commit my
;; configuration even though it is not working. Yes, I know, you shouldn't
;; do that but you have been warned.

;; Here be dragons

;; Code:
#+end_src

** custom.el
:PROPERTIES:
:ID:       8FD11880-623A-4565-BF6A-1CD545578412
:END:
In Emacs, a custom file is used to store customization settings seperately
from the main init file, allowing for easier management of user preferences.
I use this literate org-file but I like to separate the preferences all the same.

#+begin_src emacs-lisp :tangle init.el
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src

** Aliases
:PROPERTIES:
:ID:       BFE5211F-77F2-4E5A-A982-090E1A39DE5A
:END:
#+begin_src bash :tangle eshell/aliases
  # alias for emacs commands
  alias ff find-file $1

  # aliasing standard shell commands to better emacs alternatives
  alias less view-file $1

  # using exa instead of ls
  alias ls eza -al --color=always --group-directories-first $*   # my prefered listing
  alias la eza -a --color=always --group-directories-first $*    # all files and directories
  alias ll eza -l --color=always --group-directories-first $*    # long format
  alias lt eza -aT --color=always --group-directories-first $*   # tree listing
  alias l. eza -a1 $* | grep "^\."                               # list hidden files
#+end_src

** Profile
:PROPERTIES:
:ID:       2C612860-44BF-4CA6-8685-CE3E03A5EEFC
:END:
#+begin_src bash :tangle eshell/profiles
  # I had a thought what to put in here but it eluded me
#+end_src

* Package Manager
:PROPERTIES:
:ID:       2D97619F-1909-49AF-83D6-2F22271ABDB2
:END:
[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Package-Installation.html][Package installation]] are usually installed using =use-package=. Some packages
are downloaded or cloned from sources outside of the ones listed below. These
packages live in =~/.emacs.d/manual-packages=. This code sets up the package
manager, adds sources and initialize the packages manager.

#+begin_src emacs-lisp :tangle init.el
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
  			 ("melpa-stable" . "https://stable.melpa.org/packages/")
  			 ("nongnu" . "https://elpa.nongnu.org/nongnu/")
  			 ("gnu" . "https://elpa.gnu.org/packgages/")))
  (setq package-user-dir (expand-file-name "~/.emacs.d/packages"))
  (require 'package)
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
  (package-install-selected-packages)
  (require 'use-package)
#+end_src

* MacOS Specifics
:PROPERTIES:
:ID:       62E3C00E-C12C-4439-9054-A2D2E3975511
:END:
I use a MacBook (arm) for my main laptop. I *try* to keep all the MacOS stuff
behind =when= so I can use this configuration on my Linux machines as well.

** Exec path from shell
:PROPERTIES:
:ID:       C0053B78-E441-49D2-A3E2-B72980C55AA6
:END:
A GNU Emacs library to ensure environment variables inside Emacs look the same
as in the user's shell.

#+begin_src emacs-lisp :tangle init.el
(when (memq window-system '(mac ns))
  (use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-initialize)))
#+end_src

** MacOS keyboard settings
:PROPERTIES:
:ID:       C0A60C57-34BA-4EE1-BD8C-A8B67BB6B4C1
:END:
My prefered keyboard settings when on a Mac.

#+begin_src emacs-lisp :tangle init.el
  (when (eq system-type 'darwin)
    (setq mac-option-modifier 'meta
          mac-command-modifier 'super
          mac-right-option-modifier 'none)
    (global-set-key (kbd "s-c") 'kill-ring-save)
    (global-set-key (kbd "s-v") 'yank)
    (global-set-key (kbd "s-x") 'kill-region)
    (global-set-key (kbd "s-a") 'mark-whole-buffer)
    (global-set-key (kbd "s-z") 'undo)
    (global-set-key (kbd "s-f") 'isearch-forward)
    (global-set-key (kbd "s-g") 'isearch-repeat-forward)
    (global-set-key (kbd "s-o") 'find-file)
    (global-set-key (kbd "s-n") 'find-file)
    (global-set-key (kbd "s-s") 'save-buffer)
    ;(global-set-key (kbd "s-p") 'mac-preview)
    (global-set-key (kbd "s-w") 'kill-buffer)
    (global-set-key (kbd "s-m") 'iconify-frame)
    (global-set-key (kbd "s-q") 'save-buffers-kill-emacs)
    (global-set-key (kbd "s-.") 'keyboard-quit)
    (global-set-key (kbd "s-l") 'goto-line)
    (global-set-key (kbd "s-k") 'kill-buffer)
    (global-set-key (kbd "s-<up>") 'beginning-of-buffer)
    (global-set-key (kbd "s-<down>") 'end-of-buffer)
    (global-set-key (kbd "s-<left>") 'beginning-of-line)
    (global-set-key (kbd "s-<right>") 'end-of-line)
    (global-set-key [(meta down)] 'forward-paragraph)
    (global-set-key [(meta up)] 'backward-paragraph)
    )
#+end_src
* Look and Feel
:PROPERTIES:
:ID:       E1ECC95E-0B7C-4AB0-A570-6287ED65D328
:END:
