README.org
**** Nerd icons
:PROPERTIES:
:ID:       A52FC34C-0C78-4760-AFA1-E3016D8E480E
:END:
[[https://github.com/emacsmirror/nerd-icons][Nerd-icons]] - Emacs Nerd Font Icons Library.

#+begin_src emacs-lisp :tangle init.el
  (use-package nerd-icons
    :ensure t)
#+end_src
*** Windows
:PROPERTIES:
:ID:       AEB38B47-2C5B-41D8-8995-213EB26DDEB0
:END:
**** Window
:PROPERTIES:
:ID:       90A7E6E2-0E9D-4B39-A58D-C0CA75E8BE61
:END:
Setup how to split windows in Emacs.

#+begin_src emacs-lisp :tangle init.el
  (use-package window
    :ensure nil
    :bind (("C-x 2" . vsplit-last-buffer)
           ("C-x 3" . hsplit-last-buffer)
           ([remap kill-buffer] . kill-this-buffer))
    :preface
    (defun hsplit-last-buffer ()
      "Focus to the last created horizontal window."
      (interactive)
      (split-window-horizontally)
      (other-window 1))
    (defun vsplit-last-buffer ()
      "Focus to the last created vertical window."
      (interactive)
      (split-window-vertically)
      (other-window 1)))
#+end_src
**** Switch window
:PROPERTIES:
:ID:       5AC1B525-6DDB-4579-AF57-B5CA42A61CB5
:END:
[[https://github.com/dimitri/switch-window][Switch-window]] offer a visual way to choose a window to switch to.

#+begin_src emacs-lisp :tangle init.el
  (use-package switch-window
    :ensure t
    :bind (("C-x o" . switch-window)
           ("C-x w" . switch-window-then-swap-buffer)))
#+end_src
**** Winner
:PROPERTIES:
:ID:       7A6CB3DD-9D73-46BC-9E7A-B7514AD2A735
:END:
Winner mode in Emacs allows you to restore previous window configurations after
they have been changed, making it easier to manage your layout.

#+begin_src emacs-lisp :tangle init.el
  (use-package winner
    :ensure nil
    :config (winner-mode))
#+end_src
**** Ibuffer
:PROPERTIES:
:ID:       1F7902B2-3C5B-449A-8780-800FA9902DE2
:END:
I found a post [[https://tech.tonyballantyne.com/2020/09/26/ibuffer-changed-my-life/][ibuffer changed my life]] from Tony Ballantyne Tech.

#+begin_src emacs-lisp :tangle init.el
  (global-set-key (kbd "C-x C-b") 'ibuffer) ; instead of buffer-list
  (setq ibuffer-expert t)                   ; stop yes no prompt on delete
  (setq ibuffer-saved-filter-groups
        (quote (("default"
                 ("dired" (mode . dired-mode))
                 ("org" (mode . org-mode))
                 ("magit" (name . "^magit"))
                 ("planner" (or
                             (name . "^\\*Calendar\\*$")
                             (name . "^\\*Org Agenda\\*$")))
                 ("emacs" (or
                           (name . "^\\*scratch\\*$")
                           (name . "^\\*Messages\\*$")))
                 ))))
  (add-hook 'ibuffer-mode-hook (lambda ()
                                 (ibuffer-switch-to-saved-filter-groups "default")))
#+end_src
**** Dashboard
:PROPERTIES:
:ID:       E9378B2C-43B4-4481-99AF-1B9917E6BB62
:END:
[[https://github.com/emacs-dashboard/emacs-dashboard][Dashboard]] is an extensible emacs startup screen showing you what’s most important.

#+begin_src emacs-lisp :tangle init.el
  (use-package dashboard
    :ensure t
    :config
    (setq dashboard-banner-logo-text "Emacs, what else?"
          dashboard-startup-banner 'official
          dashboard-center-content t
          dashboard-vertically-center-content t
          dashboard-show-shortcuts t)
    (setq dashboard-items '((recents . 10)
                            (bookmarks . 10)
                            (projects . 10)
                            (agenda . 10)
                            (registers . 10)))
    (setq dashboard-item-shortcuts '((recents . "r")
                                     (bookmarks . "b")
                                     (projects . "p")
                                     (agenda . "a")
                                     (registers . "e")))
    (setq dashboard-navigation-cycle t
          dashboard-display-icons-p t)
          ;dashboard-icon-type 'nerd-icons
          ;dashboard-set-heading-icons t
          ;dashboard-set-file-icons t
          ;dashboard-icon-file-height 1.75
          ;dashboard-icon-file-v-adjust -0.125
          ;dashboard-heading-icon-height 1.75
          ;dashboard-heading-icon-v-adjust -0.125)
    :init
    (dashboard-setup-startup-hook))
#+end_src
* Keybindings
:PROPERTIES:
:ID:       72A6F9BB-1A72-4B97-AA4B-13D2547BB0A1
:END:
*** Evil
:PROPERTIES:
:ID:       FB3F22F7-AD87-49B3-BD8C-8F4F80E02A09
:END:
[[https://github.com/emacs-evil/evil][Evil]] is an extensible *vi* layer for Emacs.

#+begin_src emacs-lisp :tangle init.el
  (use-package evil
    :ensure t
    :init
    (setq evil-want-integration t
          evil-want-keybinding nil
          evil-vsplit-window-right t
          evil-split-window-below t
          evil-undo-system 'undo-redo)
    (evil-mode 1))
  (use-package evil-collection
    :ensure t
    :after evil
    :config
    (add-to-list 'evil-collection-mode-list 'help)
    (evil-collection-init))
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "SPC") nil)
    (define-key evil-motion-state-map (kbd "RET") nil)
    (define-key evil-motion-state-map (kbd "TAB") nil))
  (setq org-return-follows-link t)
#+end_src
*** My personal key bindings
:PROPERTIES:
:ID:       16D646B4-5F9E-4465-837F-B463C73FEADB
:END:
I will try to enter all my personal key bindings here... but some are defined
in the MacOS keyboard settings and some are defined in other places. And there
are a lot of them in the =General= section below. Oh my.

#+begin_src emacs-lisp :tangle init.el
  (global-set-key (kbd "C-c t") 'ef-themes-toggle)       ; toggle theme 
  (global-set-key (kbd "C-c g") 'magit-status)           ; magit status
  (global-set-key (kbd "C-c p") 'projectile-command-map) ; projectile command map
  (global-set-key (kbd "C-+") 'text-scale-increase)      ; increase text size
  (global-set-key (kbd "C--") 'text-scale-decrease)      ; decrease text size
  (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
  (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
  (global-set-key [escape] 'keyboard-escape-quit)        ; be default, Emacs requires you to hit ESC
                                                         ; three times to escape quit the minibuffer
#+end_src
*** IVY and Counsel
:PROPERTIES:
:ID:       2C08455B-6D25-4334-AE33-8C7AE134B2FE
:END:
#+begin_src emacs-lisp :tangle init.el
  (use-package counsel
    :ensure t
    :after ivy
    :diminish
    :config
    (counsel-mode)
    (setq ivy-initial-inputs-alist nil))

  (use-package ivy
    :ensure t
    :bind
    (("C-c C-r" . ivy-resume)
     ("C-x B" . ivy-switch-buffer-other-window))
    :diminish
    :custom
    (setq ivy-use-virtual-buffers t
          ivy-count-format "(%d/%d) "
          enable-recursive-minibuffers t)
    :config
    (ivy-mode))

  (use-package all-the-icons-ivy-rich
    :ensure t
    :init (all-the-icons-ivy-rich-mode 1))

  (use-package ivy-rich
    :ensure t
    :after ivy
    :init (ivy-rich-mode 1)
    :custom (ivy-virtual-abbreviate 'full
                                    ivy-rich-switch-buffer-align-virtual-buffer t
                                    ivy-rich-path-style 'abbrev)
    :config
    (ivy-set-display-transformer 'ivy-switch-buffer
                                 'ivy-rich-switch-buffer-transformer))
#+end_src
