init.el

(use-package nerd-icons
  :ensure t)

(use-package window
  :ensure nil
  :bind (("C-x 2" . vsplit-last-buffer)
         ("C-x 3" . hsplit-last-buffer)
         ([remap kill-buffer] . kill-this-buffer))
  :preface
  (defun hsplit-last-buffer ()
    "Focus to the last created horizontal window."
    (interactive)
    (split-window-horizontally)
    (other-window 1))
  (defun vsplit-last-buffer ()
    "Focus to the last created vertical window."
    (interactive)
    (split-window-vertically)
    (other-window 1)))

(use-package switch-window
  :ensure t
  :bind (("C-x o" . switch-window)
         ("C-x w" . switch-window-then-swap-buffer)))

(use-package winner
  :ensure nil
  :config (winner-mode))

(global-set-key (kbd "C-x C-b") 'ibuffer) ; instead of buffer-list
(setq ibuffer-expert t)                   ; stop yes no prompt on delete
(setq ibuffer-saved-filter-groups
      (quote (("default"
               ("dired" (mode . dired-mode))
               ("org" (mode . org-mode))
               ("magit" (name . "^magit"))
               ("planner" (or
                           (name . "^\\*Calendar\\*$")
                           (name . "^\\*Org Agenda\\*$")))
               ("emacs" (or
                         (name . "^\\*scratch\\*$")
                         (name . "^\\*Messages\\*$")))
               ))))
(add-hook 'ibuffer-mode-hook (lambda ()
                               (ibuffer-switch-to-saved-filter-groups "default")))

(use-package dashboard
  :ensure t
  :config
  (setq dashboard-banner-logo-text "Emacs, what else?"
        dashboard-startup-banner 'official
        dashboard-center-content t
        dashboard-vertically-center-content t
        dashboard-show-shortcuts t)
  (setq dashboard-items '((recents . 10)
                          (bookmarks . 10)
                          (projects . 10)
                          (agenda . 10)
                          (registers . 10)))
  (setq dashboard-item-shortcuts '((recents . "r")
                                   (bookmarks . "b")
                                   (projects . "p")
                                   (agenda . "a")
                                   (registers . "e")))
  (setq dashboard-navigation-cycle t
        dashboard-display-icons-p t)
        ;dashboard-icon-type 'nerd-icons
        ;dashboard-set-heading-icons t
        ;dashboard-set-file-icons t
        ;dashboard-icon-file-height 1.75
        ;dashboard-icon-file-v-adjust -0.125
        ;dashboard-heading-icon-height 1.75
        ;dashboard-heading-icon-v-adjust -0.125)
  :init
  (dashboard-setup-startup-hook))
