README.org
*** General key binding
:PROPERTIES:
:ID:       A1806E5F-CE5B-4D1C-BB4E-64BA60D8E527
:END:
[[https://github.com/noctuid/general.el][General]] is a more convenient key definition system in Emacs.
#+begin_src emacs-lisp :tangle init.el
  (use-package general
    :ensure t
    :config
    (general-evil-setup)
    ;; set up "SPC" as the global leader key
    (general-create-definer my/leader-keys
                            :states '(normal insert visual emacs)
                            :keymaps 'override
                            :prefix "SPC"
                            :global-prefix "M-SPC") ; access leader key in insert mode
    (my/leader-keys
     "SPC" '(counsel-M-x :wk "Counsel M-x")
     "." '(find-file :wk "Find file")
     "TAB TAB" '(comment-line :wk "Comment lines")
     "u" '(universal-argument :wk "Universal argument")
     )

    (my/leader-keys
      "b" '(:ignore t :wk "Bookmarks/Buffers")
      "b b" '(switch-to-buffer :wk "Switch to buffer")
      "b c" '(clone-indirect-buffer :wk "Create indirect buffer copy in a split")
      "b C" '(clone-indirect-buffer-other-window :wk "Clone indirect buffer in new window")
      "b d" '(bookmark-delete :wk "Delete bookmark")
      "b i" '(ibuffer :wk "Ibuffer")
      "b k" '(kill-current-buffer :wk "Kill current buffer")
      "b l" '(list-bookmarks :wk "List bookmarks")
      "b m" '(bookmark-set :wk "Set bookmark")
      "b n" '(next-buffer :wk "Next buffer")
      "b p" '(previous-buffer :wk "Previous buffer")
      "b r" '(revert-buffer :wk "Reload buffer")
      "b R" '(rename-buffer :wk "Rename buffer")
      "b s" '(basic-save-buffer :wk "Save buffer")
      "b S" '(save-some-buffers :wk "Save multiple buffers")
      "b w" '(bookmark-save :wk "Save current bookmarks to bookmark file")
      )

    (my/leader-keys
      "d" '(:ignore t :wk "Dired")
      "d d" '(dired :wk "Open dired")
      "d j" '(dired-jump :wk "Dired jump to current")
      )

    (my/leader-keys
      "e" '(:ignore t :wk "Eshell/Evaluate")
      "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
      "e d" '(eval-defun :wk "Evaluate defun containing or after point")
      "e e" '(eval-expression :wk "Evaluate and elisp expression")
      "e h" '(counsel-ssh-history :wk "Eshell history")
      "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
      "e r" '(eval-region :wk "Evaluate elisp in region")
      "e R" '(eww-reload :wk "Reload current page in EWW")
      "e s" '(eshell :wk "Eshell")
      "e w" '(eww :wk "EWW emacs web browser")
      )

    (my/leader-keys
      "f" '(:ignore t :wk "Files")
      "f c" '((lambda () (interactive) (find-file "~/.emacs.d/README.org")) :wk "Open emacs configuration file")
      "f e" '((lambda () (interactive) (dired "~/.emacs.d/")) :wk "Open user-emacs-directory in dired")
      "f g" '(counsel-grep-or-swiper :wk "Search for string current file")
      "f j" '(counsel-file-jump :wk "Jump to a file below current directory")
      "f l" '(counsel-locate :wk "Locate a file")
      "f r" '(counsel-recentf :wk "Find recent files")
      )

    (my/leader-keys
      "g" '(:ignore t :wk "Git")
      "g d" '(magit-dispatch :wk "Magit dispatch")
      "g ." '(magit-file-dispatch :wk "Magit file dispatch")
      "g b" '(magit-branch-checkout :wk "Switch branch")
      "g c" '(:ignore t :wk "Create")
      "g c b" '(magit-branch-and-checkout :wk "Create branch and checkout")
      "g c c" '(magit-commit-create :wk "Create commit")
      "g c f" '(magit-commit-fixup :wk "Create fixup commit")
      "g C" '(magit-clone :wk "Clone repo")
      "g f" '(:ignore t :wk "Find")
      "g f c" '(magit-show-commit :wk "Magit show commit")
      "g f f" '(magit-find-file :wk "Magit find file")
      "g f g" '(magit-find-git-config-file :wk "Find gitconfig file")
      "g F" '(magit-fetch :wk "Git fetch")
      "g g" '(magit-status :wk "Magit status")
      "g i" '(magit-init :wk "Initialize git repo")
      "g l" '(magit-log-buffer-file :wk "Magit buffer log")
      "g r" '(vc-revert :wk "Git revert file")
      "g s" '(magit-stage-file :wk "Git stage file")
      "g u" '(magit-unstage-file :wk "Git unstage file")
      )

    (my/leader-keys
      "h" '(:ignore t :wk "Help")
      "h a" '(counsel-apropos :wk "Apropos")
      "h b" '(describe-bindings :wk "Desc. bindings")
      "h c" '(describe-char :wk "Desc. character under cursor")
      "h d" '(:ignore t :wk "Emacs documentation")
      "h d a" '(about-emacs :wk "About Emacs")
      "h d d" '(view-emacs-debugging :wk "View Emacs debugging")
      "h d f" '(view-emacs-FAQ :wk "View Emacs FAQ")
      "h d m" '(info-emacs-manual :wk "The Emacs manual")
      "h d n" '(view-emacs-news :wk "View Emacs News")
      "h d o" '(describe-distribution :wk "How to obtain Emacs")
      "h d p" '(view-emacs-problems :wk "View Emacs problems")
      "h d t" '(view-emacs-todo :wk "View Emacs todo")
      "h d w" '(describe-no-warranty :wk "Desc. no warranty")
      "h e" '(view-echo-area-messages :wk "View echo area messages")
      "h f" '(describe-function :wk "Desc. function")
      "h F" '(describe-face :wk "Desc. face")
      "h g" '(describe-gnu-project :wk "Desc. GNU Project")
      "h i" '(info :wk "Info")
      "h I" '(describe-input-method :wk "Desc. input method")
      "h k" '(describe-key :wk "Desc. key")
      "h l" '(view-lossage :wk "Display recent keystrokes and the commands run")
      "h L" '(describe-language-environment :wk "Desc. language environment")
      "h m" '(describe-mode :wk "Desc. mode")
      "h r" '(:ignore t :wk "Reload")
      "h r r" '((lambda () (interactive) (load-file "~/.emacs.d/init.el")) :wk "Reload emacs config")
      "h t" '(load-theme :wk "Load theme")
      "h v" '(describe-variable :wk "Desc. variable")
      "h w" '(where-is :wk "Prints keybinding for command if set")
      "h x" '(describe-command :wk "Desc. command")
      )

    (my/leader-keys
      "m" '(:ignore t :wk "Org")
      "m i" '(org-id-get-create :wk "Add org-id")
      )

    (my/leader-keys
      "o" '(:ignore t :wk "Open")
      )

    (my/leader-keys
      "p" '(projectile-command-map :wk "Projectile")
      )

    (my/leader-keys
      "s" '(:ignore t :wk "Search")
      )

    (my/leader-keys
      "t" '(:ignore t :wk "Toggle")
      "t t" '(ef-themes-toggle :wk "Switch light/dark theme")
      "t e" '(eshell-toggle :wk "Toggle Eshell")
      )

    (my/leader-keys
      "w" '(:ignore t :wk "Windows")
      )
    
    ) 
#+end_src
*** Helpful
:PROPERTIES:
:ID:       7F88630C-0567-4798-8A24-3F47897D0459
:END:
[[https://github.com/Wilfred/helpful][Helpful]] is an alternative to the built-in Emacs help that provides much more contextual information.

#+begin_src emacs-lisp :tangle init.el
  (use-package helpful
    :ensure t
    :commands (helpful-at-point
  	     helpful-callable
  	     helpful-command
  	     helpful-function
  	     helpful-key
  	     helpful-macro
  	     helpful-variable)
    :bind
    ([remap display-local-help] . helpful-at-point)
    ([remap describe-function] . helpful-callable)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-key] . helpful-key)
    ([remap describe-command] . helpful-command))
#+end_src
*** Move text
:PROPERTIES:
:ID:       100C208D-B7B7-46B8-9532-E88D6D22363E
:END:
[[https://github.com/emacsfodder/move-text][MoveText]] allows you to move the current line using M-up / M-down (or any other bindings you choose)
if a region is marked, it will move the region instead.

#+begin_src emacs-lisp :tangle init.el
  (use-package move-text
    :ensure t
    :defer
    :init (move-text-default-bindings))
#+end_src
* Programming
:PROPERTIES:
:ID:       8709FAA7-0C31-4A4A-A9B6-66657F6E64CE
:END:
** Version control
:PROPERTIES:
:ID:       293B7A79-0104-4C3E-8779-42A2169B2D4B
:END:
*** Magit
:PROPERTIES:
:ID:       3DB14266-BB7A-4E66-9FB2-E82EBD023137
:END:
[[https://magit.vc/][Magit]] is a complete text-based user interface to Git. It fills the glaring gap between
the Git command-line interface and various GUIs, letting you perform trivial as well as
elaborate version control tasks with just a couple of mnemonic key presses. Magit looks
like a prettified version of what you get after running a few Git commands but in Magit
every bit of visible information is also actionable to an extent that goes far beyond
what any Git GUI provides and it takes care of automatically refreshing this output when
it becomes outdated. In the background Magit just runs Git commands and if you wish you
can see what exactly is being run, making it possible for you to learn the git command-line
by using Magit.


#+begin_src emacs-lisp :tangle init.el
  (use-package magit
    :ensure t)
#+end_src
** Project management
:PROPERTIES:
:ID:       49438366-85D9-4A0E-BB53-07B43B008111
:END:
*** Projectile
:PROPERTIES:
:ID:       EE60E280-166C-4E61-9D25-44E76FFBBCD6
:END:
[[https://github.com/bbatsov/projectile][Projectile]] is a project interaction Library for Emacs.

#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-mode +1)
    )
#+end_src
* Org
:PROPERTIES:
:ID:       DF0F20D5-3676-461D-A32B-135A2938F655
:END:
** Org
:PROPERTIES:
:ID:       84F211C4-35D7-41D3-B627-D56A7B5D4CC6
:END:
Why usse Emacs? Because [[https://orgmode.org/][Org-mode]] exists. Org-mode is a  GNU Emacs major mode for
keeping notes, authoring documents, computational notebooks, literate programming,
maintaining to-do lists, planning projects, and more — in a fast and effective
plain text system.

This configuration file is writen with org-mode.

#+begin_src emacs-lisp :tangle init.el
  (use-package org
    :ensure t)
#+end_src

** Org make-toc
:PROPERTIES:
:ID:       A15DEAD6-7CE9-4F4D-871A-A91ADB0E0475
:END:
[[https://github.com/alphapapa/org-make-toc][Org-make-toc]] creates tables of contents for org-mode files.

A document may have any number of tables of contents (TOCs), each of which may list entries in a highly
configurable way.

To make a basic TOC, follow these steps:

1. Choose a heading to contain a TOC and move the point to it.
2. Run command =org-make-toc-insert=, which inserts a =:CONTENTS:= drawer and sets TOC properties.
   Set the =include= property to all.
3. Run the command =org-make-toc= to update all TOCs in the document.

Use command =org-make-toc-set= to change TOC properties for the entry at point with completion.

#+begin_src emacs-lisp :tangle init.el
  (use-package org-make-toc
    :ensure t)

  (defun my/update-toc-before-save-hook ()
    "Update TOC before saving buffer in org-mode"
    (when (eq major-mode 'org-mode)
      (message "Updateing TOC")
      (org-make-toc)
      ))

  (add-hook 'before-save-hook #'my/update-toc-before-save-hook)

  (defun my/org-add-ids-to-headlines-in-file ()
    "Add ID properites to all headlines in the current file which do not already have one."
    (interactive)
    (org-map-entries 'org-id-get-create))

  (add-hook 'org-mode-hook
            (lambda () (add-hook 'before-save-hook 'my/org-add-ids-to-headlines-in-file nil 'local)))
#+end_src

** Org tempo
:PROPERTIES:
:ID:       DC15D1B6-20EE-4109-8BF0-F6B94476ACCD
:END:
With [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] it is possible to insert empty structural blocks,
such as ‘#+BEGIN_SRC’ … ‘#+END_SRC’, or to wrap existing text in such a block.

|-----+-----------------------------------------|
| Key | Template                                |
|-----+-----------------------------------------|
| c   | ‘#+BEGIN_CENTER’ … ‘#+END_CENTER’       |
| C   | ‘#+BEGIN_COMMENT’ … ‘#+END_COMMENT’     |
| e   | ‘#+BEGIN_EXAMPLE’ … ‘#+END_EXAMPLE’     |
| a   | ‘#+BEGIN_EXPORT ascii’ … ‘#+END_EXPORT’ |
| h   | ‘#+BEGIN_EXPORT html’ … ‘#+END_EXPORT’  |
| l   | ‘#+BEGIN_EXPORT latex’ … ‘#+END_EXPORT’ |
| E   | ‘#+BEGIN_EXPORT’ … ‘#+END_EXPORT’       |
| q   | ‘#+BEGIN_QUOTE’ … ‘#+END_QUOTE’         |
| el  | ‘#+BEGIN_SRC emacs-lisp’ … ‘#+END_SRC’  |
| s   | ‘#+BEGIN_SRC’ … ‘#+END_SRC’             |
| v   | ‘#+BEGIN_VERSE’ … ‘#+END_VERSE’         |
|-----+-----------------------------------------|

#+begin_src emacs-lisp :tangle init.el
  (use-package org-tempo
    :config
    (add-to-list 'org-structure-template-alist
  	       '("el" . "src emacs-lisp")))
#+end_src

** Org bullets
:PROPERTIES:
:ID:       95F6F7DF-ECAC-44C5-942C-E4C6B9566812
:END:
#+begin_src emacs-lisp :tangle init.el
  (use-package org-bullets
    :ensure t
    )
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

* Internet
:PROPERTIES:
:ID:       8DDCFFD3-145A-4C90-93C7-24C46C9D7C27
:END:
** Browse URL
:PROPERTIES:
:ID:       12DC22A6-3EF0-4776-9082-255707B1C875
:END:
TODO work in progress

#+begin_src emacs-lisp :tangle init.el
  (use-package browse-url
    :ensure nil
    :custom
    (browse-url-chrome-program "/Application/Google Chrome.app/Contents/MacOS/Google Chrome")
    (browse-url-browser-function 'eww-browse-url)
    :config
    (put 'browse-url-handlers 'safe-local-variable (lambda (x) t))
    (put 'browse-url-browser-function 'safe-local-variable (lambda (x) t)))
#+end_src
** Elfeed
:PROPERTIES:
:ID:       C27C657D-75BD-4249-8101-DA871EB52779
:END:
[[https://github.com/skeeto/elfeed][An Emacs web feeds client]].
#+begin_src emacs-lisp :tangle init.el
  (use-package elfeed
    :ensure t
    :config
    (setq elfeed-search-feed-face ":foreground #ffffff :weight bold"
          elfeed-feeds (quote
                        (("https://www.reddit.com/r/emacs.rss" reddit emacs)
                         ("https://sachachua.com/blog/category/emacs-news/feed" sacha emacs)
                         ))))
#+end_src
* Shells and terminals
:PROPERTIES:
:ID:       FBDC9DB9-8F25-4EC9-BCF1-06B06273FF3A
:END:
** Eshell
:PROPERTIES:
:ID:       08123C06-2670-4ECB-83EF-CA5F8CC22F3F
:END:
Eshell is an Emacs shell written in Elisp.
#+begin_src emacs-lisp :tangle init.el
  (use-package eshell-toggle
    :ensure t
    :custom
    (eshell-toggle-size-fraction 3)
    (ehsell-toggle-use-projectile-root t)
    (eshell-toggle-run-command nil)
    (ehsell-toggle-init-function #'eshell-toggle-init-ansi-term))

  (use-package eshell-syntax-highlighting
    :ensure t
    :after esh-mode
    :config
    (eshell-syntax-highlighting-global-mode +1))

  (setq eshell-rc-script (concat user-emacs-directory "eshell/profile")
        eshell-aliases-file (concat user-emacs-directory "eshell/aliases")
        eshell-history-size 5000
        eshell-buffer-maximum-lines 5000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t
        eshell-visual-commands '("bash" "fish" "htop" "ssh" "top" "zsh"))
#+end_src
