init.el

(use-package magit
  :ensure t)

(use-package org
  :ensure t)

(use-package org-make-toc
  :ensure t)

(use-package org-tempo
  :config
  (add-to-list 'org-structure-template-alist
	       '("el" . "src emacs-lisp")))

(use-package browse-url
  :ensure nil
  :custom
  (browse-url-chrome-program "/Application/Google Chrome.app/Contents/MacOS/Google Chrome")
  (browse-url-browser-function 'eww-browse-url)
  :config
  (put 'browse-url-handlers 'safe-local-variable (lambda (x) t))
  (put 'browse-url-browser-function 'safe-local-variable (lambda (x) t)))

(use-package elfeed
  :ensure t
  :config
  (setq elfeed-search-feed-face ":foreground #ffffff :weight bold"
        elfeed-feeds (quote
                      (("https://www.reddit.com/r/emacs.rss" reddit emacs)
                       ("https://sachachua.com/blog/category/emacs-news/feed" sacha emacs)
                       ))))
